using AngularApi.Models;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace AngularApi.Models
{
    public class DB
    {
        public static
            List<User> allUsers = new List<User>()
            {
                new User()
                {
              id=1,
              name ="אלישבע",
              address="ירושלים",
              mail="a3232815@gmail.com",
              password="123456Er",
                },

             };






//        List<Kategory> allKategories = new List<Kategory>()
//        {
//            new Kategory()
//            {
//                id=0,
//              name ="מאפים",
//              iconSrc="https://www.10dakot.co.il/wp-content/uploads/2017/07/%E2%80%8F%E2%80%8FDSC_0089-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
//            },

//            new Kategory()
//            {
//                id=1,
//              name ="סלטים",
//              iconSrc="https://www.10dakot.co.il/wp-content/uploads/2013/07/DSC_0006-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
//            },

//            new Kategory()
//            {
//                id=2,
//              name = "עוף ובשר",
//              iconSrc="https://www.10dakot.co.il/wp-content/uploads/2017/07/%D7%9B%D7%A0%D7%A4%D7%99%D7%99%D7%9D-%D7%91%D7%AA%D7%A0%D7%95%D7%A8.jpg"
//            },

//            new Kategory()
//            {
//                id=3,
//              name = "תוספות",
//              iconSrc="https://www.10dakot.co.il/wp-content/uploads/2020/12/%E2%80%8F%E2%80%8F20201204_131703-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
//            },

//            new Kategory()
//            {
//                id=4,
//              name = "מרקים",
//              iconSrc= "https://www.10dakot.co.il/wp-content/uploads/2017/06/%E2%80%8F%E2%80%8FDSC_0260-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
//            },

//            new Kategory()
//            {
//                id=5,
//              name = "חלבי",
//              iconSrc="https://www.10dakot.co.il/wp-content/uploads/2016/06/%E2%80%8F%E2%80%8FDSC_0062-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
//            };
//    }
//}


                
        public static List<Resipe> allResips = new List<Resipe>()
        {
            new Resipe()
            {
                idResipe =1,
                nameResipe = "חזה עוף עם שעועית",
                idKategory = 2,
                preparationTime = 10,
                DifficultyLevel = 3,
                dateAdd = new DateTime(),
                components = new List<string>() { "500 גרם חזה עוף חתוך לרצועות או קוביות","1 בצל גדול חתוך גס","2 כוסות שעועית ירוקה משקית קפואה",
                    "3 גזרים בינוניים חתוכים לרצועות דקות","תיבול: 2 כפות גדושות סילאן, 5 כפות רוטב סויה, מעט פלפל שחור גרוס, קמצוץ תבלין צ’ילי (לא חובה)*שומשום לקישוט מעל (לא חובה)"},
                preparation = new List<string>() {  "מחממים מחבת עם 1-2 כפות שמן על להבה בינונית ומטגנים את חזה העוף כדקה מכל צד (מומלץ להשתמש במחבת עם ציפוי שאינו נדבק). מעבירים לצלחת.","מנגבים את המחבת משאריות הנוזלים, מוסיפים כף שמן ומטגנים את הבצל עד להזהבה קלה.",
                    "מוסיפים את הגזר וממליחים מעט. מכסים את המחבת ומבשלים במשך 5-7 דקות, עד שהגזר מתרכך קלות. מערבבים מידי פעם."
                    ,"מוסיפים את השעועית הירוקה ומבשלים במשך כ-3 דקות."
                    ,"מוסיפים למחבת את חזה העוף שטיגנו קודם לכן ומתבלים בסילאן, סויה, פלפל שחור ומעט צ’ילי. מערבבים במשך כ-2 דקות, עד לספיגת הטעמים. מפזרים שומשום לקישוט."},
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2021/08/%D7%97%D7%96%D7%94-%D7%A2%D7%95%D7%A3-%D7%A2%D7%9D-%D7%A9%D7%A2%D7%95%D7%A2%D7%99%D7%AA-%D7%99%D7%A8%D7%95%D7%A7%D7%94.jpg"
            },


             new Resipe()
            {
                idResipe = 2,
                nameResipe = "בצק פילו ממולא חזה",
                idKategory = 2,
                preparationTime =10,
                DifficultyLevel = 3,
                dateAdd = new DateTime(),
                components =  new List<string>(){"10 דפי פילו (מופשרים שעתיים בחוץ או 12 שעות במקרר)",
                 "למילוי :",
                 "1 בצל בינוני קצוץ",
                 "500 גרם חזה עוף חתוך לקוביות קטנות",
                 "תיבול: 2 כפות סילאן, 2 כפות צ’ילי מתוק, חצי כפית מלח, חצי כפית פפריקה מתוקה, מעט פלפל שחור",
                 "*שמן למריחה"
             },
                preparation = new List<string>() {"לפני ההכנה מומלץ לקרוא : איך עובדים עם בצק פילו.",
"מחממים מחבת רחבה עם 1-2 כפות שמן ומטגנים את הבצל עד להזהבה קלה. מוסיפים את קוביות חזה העוף ומטגנים כדקה. הופכים צד ומטגנים כדקה נוספת. מתבלים בסילאן, צ’ילי מתוק, מלח, פפריקה ופלפל שחור. מערבבים כדקה, עד שחזה העוף מתבשל. מסירים מהאש ומניחים לתערובת להתקרר. ",
"מחממים תנור מראש ל- 190 מעלות ומרפדים את תבנית התנור בנייר אפיה.",
"מניחים דף פילו על משטח עבודה ומשמנים אותו. חותכים ל-4 חלקים שווים. מניחים אותם אחד מעל השני בצורה אלכסונית (מומלץ להסתכל בתמונות ההכנה בתחתית המתכון). מניחים במרכז 2 כפות מתערובת המילוי. מרימים את הקצוות וסוגרים לשקיק תוך כדי שמועכים את הקצוות כך שיצמדו זו לזו (חשוב להדק היטב). חוזרים על הפעולה עם יתר דפי הפילו.",
"מניחים את השקיקים על נייר אפיה משומן ומברישים כל שקיק בשמן.",
"מכניסים לתנור החם ואופים במשך כ-20 דקות, עד להזהבה יפה.",

 },
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2021/06/%E2%80%8F%E2%80%8FDSC_0006-%D7%A2%D7%95%D7%AA%D7%A7-420x279.jpg"
            },


                          new Resipe()
            {
                idResipe = 3,
                nameResipe = "מוסקה חצילים",
                idKategory = 2,
                preparationTime = 30,
                DifficultyLevel = 2,
                dateAdd = new DateTime(),
                components = new List<string>() {
" תבנית פיירקס מלבנית קטנה בגודל  15 X30",
"2 חצילים גדולים מאורכים",
"1 בצל בינוני קצוץ",
"500 גרם בשר בקר טחון",
"3-4 שיני שום כתושות/קצוצות",
"400 גרם עגבניות מרוסקות",
"כף גדושה רסק ",
"עגבניות",
"שליש כוס כוסברה קצוצה ",
"תיבול לרוטב: כפית פפריקה מתוקה, חצי כפית כמון, כפית  מלח, שליש כפית פלפל שחור,",
"עגבנייה גדולה חתוכה לפרוסות דקות ",
"רבע כפית תבלין אורגנו/ בזיליקום ",
"מעט מלח ופלפל שחור ",
 },
               preparation = new List<string>() {  "הכנת החצילים:",
"פורסים את החצילים לאורך לפרוסות בעובי עד 1 ס”מ. מפזרים עליהם מלח ומניחים בצד לפחות חצי שעה עד שהחצילים מפרישים נוזלים. שוטפים את פרוסות החצילים ומנגבים היטב (זה בכדי להוציא את המרירות מהחצילים).",
"משמנים את החצילים משני הצדדים בשמן זית ומניחים על נייר אפיה. אופים בתנור שחומם מראש ל190 מעלות במשך חצי שעה. לאחר מכן הופכים את החצילים צד ומשאירים 15 דקות נוספות.",
"  רוטב עגבניות ובשר טחון:",
"מטגנים בצל קצוץ עם 2 כפות שמן עד להזהבה קלה. מוסיפים את הבשר הטחון ומערבבים במשך 3-4 דקות עד שמשנה צבעו. מוסיפים שום, עגבניות מרוסקות, רסק ומערבבים היטב.",
"מתבלים בפפריקה, כמון, מלח, פלפל שחור ומערבבים. מבשלים כ-5 דקות. מוסיפים את הכוסברה הקצוצה, מערבבים כדקה נוספת ומסירים מהאש.",
"סידור המנה:",
"משמנים את התבנית.",
"מסדרים שליש מפרוסות החציל בתחתית (באופן שיכסו את התחתית). מעל משטחים חצי מכמות רוטב הבשר הטחון. ",

"מעל מסדרים שליש מפרוסות החצילים, מעל משטחים את   מחצית הרוטב שנותר ובסוף מניחים שוב חצילי",
"משמנים פרוסות עגבנייה בשמן זית ומניחים אותן מעל החצילים. מפזרים מעט מלח ופלפל שחור בעזרת המלחייה  ורבע כפית תבלין אורגנו/בזיליקום.",
"מכניסים לתנור שחומם מראש ל190 מעלות במשך 35-40 דקות.",

               },
                idMistamesh =0,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2021/05/%D7%9E%D7%95%D7%A1%D7%A7%D7%94.png"
            },


            new Resipe()
            {
                idResipe = 4,
                nameResipe = "מאפינס גרנולה",
                idKategory = 0,
                preparationTime = 10,
                DifficultyLevel = 1,
                dateAdd = new DateTime(),
                components = new List<string>() { "תבנית שקעים/מאפינס"," L או XL 1 ביצה","1/3 כוס שמן קנולה","1/3 כוס סירופ מייפל","⅔ כוס (160 מ”ל) מיץ תפוזים","¾ כוס (80 ג’) קמח כוסמין לבן או 70% (אפשר להשתמש גם בקמח רגיל)",
                 "חצי כוס (40 ג’) שיבולת שועל דקה (קוואקר דק/להכנה מהירה",

                 "שליש כוס אגוזים קצוצים דק מכל סוג (אגוזי מלך, פקאן, שקדים וכו’)",

                  " 1 כפית (5 ג’) אבקת אפיה",

                  " חצי כפית אבקת קינמון",

                  " תוספות (לא חובה): 2 כפות קוקוס טחון ו/או 3 כפות שוקולד צ’יפס }" },

                preparation = new List<string>() { "מחממים תנור מראש ל-180 מעלות ומרפדים תבנית מאפינס במנג’טים (אם משתמשים בתבנית מאפינס מסיליקון מספיק לשמן את השקעים).",

                 "מערבבים בקערה ביצה, שמן, סירופ מייפל ומיץ תפוזים. בקערה נפרדת מערבבים: קמח, שיבולת שועל, אגוזים, אבקת אפיה וקינמון (אפשר להוסיף גם קוקוס ו/או שוקולד צ’יפס).",

                 "מוסיפים את תערובת היבשים לקערת הרטובים ומערבבים עד לאיחוד חומרים (יש להימנע מערבוב יתר שעלול לפגוע באווריריות המאפינס).",

                  "יוצקים את התערובת לתוך המנג’טים ואופים בתנור במשך 22-25 דקות, עד שקיסם יוצא יבש.",

                 " מהתנור ומניחים למאפינס להתקרר לגמרי." },
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2018/07/%E2%80%8F%E2%80%8FDSC_0010-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
            },


             new Resipe()
            {
                idResipe = 5,
                nameResipe = "עוף עם אננס בתנור",
                idKategory = 2,
                preparationTime = 10,
                DifficultyLevel = 1,
                dateAdd = new DateTime(),
                components = new List<string>() {
                 "10 חתיכות עוף לפי הטעם- שוקיים, ירכיים, כנפיים   ",

                 "3 תפוחי אדמה בינוניים קלופים חתוכים לקוביות",
                 "פלפל אדום (גמבה) חתוך בינוני",
                 "8 פרוסות אננס מקופסת שימורים (280 גרם מסונן, בלי הנוזלים)",
                 "תיבול: כף שמן זית, 2 כפות מלאות סילאן, כף רוטב סויה, 3 שיני שום כתושות, חצי כפית מלח, קמצוץ פלפל שחור",
                     },

                preparation = new List<string>() {
                 "מערבבים את כל חומרי הרוטב בקערית ומרפדים את תבנית התנור בנייר אפיה.",
                 "מניחים את חלקי העוף, תפוחי אדמה, גמבה ואננס על נייר האפיה ומתבלים בצורה אחידה.",
                 "מכניסים לתנור שחומם ל- 180 מעלות למשך כשעה וחצי- שעתיים.", },
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2019/09/%E2%80%8F%E2%80%8FDSC_0059-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
            },

              new Resipe()
            {
                idResipe = 6,
                nameResipe = "עוף בריבת תפוזים",
                idKategory = 1,
                preparationTime = 10,
                DifficultyLevel = 2,
                dateAdd = new DateTime(),
                components = new List<string>() {
                " עוף שלם או 8 חלקי עוף (ירכיים, שוקיים, כנפיים)",
                 "4 תפוחי אדמה בינוניים קלופים חתוכים לקוביות בגודל 2X2 ס”מ",
                 "רוטב לעוף:2 כפות שמן זית, 3 כפות מלאות ריבת תפוזים, כפית שום כתוש, כף מלאה דבש, כף רוטב סויה, חצי כפית מלח, קמצוץ פלפל שחור", },
                preparation = new List<string>() {
                 "מערבבים את חומרי הרוטב בקערית ומתבלים את העוף ותפוחי האדמה.",
                 "מניחים בתבנית ענקית ומכניסים לתנור שחומם ל-180 מעלות במשך שעה וחצי-שעתיים (חום עליון וחום תחתון).",
                },


                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2019/01/%E2%80%8F%E2%80%8FDSC_0052-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
            },
               new Resipe()
            {
                idResipe = 7,
                nameResipe = "נודלס עם בשר טחון",
                idKategory = 2,
                preparationTime = 30,
                DifficultyLevel = 3,
                dateAdd = new DateTime(),
                components = new List<string>() {
                "200 גרם נודלס (אטריות ביצים)",
                 "350-400 גרם בשר בקר טחון",
                 "1 בצל בינוני קצוץ",
                 "גמבה חתוכה לרצועות קצרות ודקות",
                 "גזר גדול קלוף חתוך לגפרורים",
                 "כשליש כוס עלי כוסברה טריים קצוצים",
                 "תיבול: 3 כפות רוטב סויה, 2 כפות סילאן, מלח לפי הטעם, קמצוץ פלפל שחור וכחצי כפית תבלין צ’ילי חריף (אפשר לוותר).",
                },
                preparation = new List<string>() {
                "מבשלים את הנודלס לפי הוראות שעל גבי האריזה (אם רוצים שהנודלס יהיו בצבע צהוב מומלץ להוסיף חצי כפית כורכום למי הבישול). לאחר שהנודלס מבושל מעבירים למסננת ומזליפים מעל מעט שמן זית.",
                 "מחממים מחבת עם 2 כפות שמן ומטגנים את הבצל עד להזהבה קלה. מוסיפים גזר וגמבה, ממליחים מעט ומבשלים במשך 5-7 דקות, עד לריכוך חלקי.",
                 "מוסיפים את הבשר הטחון ומערבבים במשך כ-5 דקות עד שהוא משנה את צבעו ומתבשל. מוסיפים את הנודלס המבושל ומתבלים בסויה, סילאן, מעט מלח, פלפל שחור ותבלין צ’ילי. מפזרים עלי כוסברה קצוצים ומערבבים. מבשלים 3-4 דקות לספיגת הטעמים.",
                },
                idMistamesh = 0,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2017/11/DSC_0095-1.jpg"
            },

            new Resipe()
            {
                idResipe = 8,
                nameResipe = "עוף ואורז בתנור",
                idKategory = 2,
                preparationTime = 25,
                DifficultyLevel = 2,
                dateAdd = new DateTime(),
                components = new List<string>() {
                "8 שוקי עוף",
                 "2 כוסות אורז לבן (*יש להשרות את האורז עם מי ברז כשעה לפחות לפני ההכנה ולסנן)",
                 "2 גזרים בינוניים קלופים מגורדים",
                 "2 שיני שום כתושות",
                 "כף שמן",
                 "כפית מלאה מלח",
                 "3+1/4 (שלוש ורבע) כוסות מים רותחים",
                   "תיבול לעוף: כף גדושה סילאן, כפית גדושה פפריקה מתוקה, שליש כפית מלח, קמצוץ פלפל שחור",
                },              
                preparation = new List<string>() {
                "מערבבים בתבנית את האורז עם הגזר המגורד, השום, כף שמן וכפית מלאה מלח. מוזגים לתבנית מים רותחים ומערבבים עם האורז.",
                 "ל שחור. מניחים את חלקי העוף בתוך תערובת האורז.",
                 "מכסים את התבנית בנייר כסף ומכניסים לתנור שחומם מראש על 190 מעלות במשך כשעה וחצי.",
                 "הפעל טיימר (90 דק’)",
                 "מסירים את הכיסוי, מורידים את הטמפ’ ל180 מעלות וממשיכים לאפות 15-20 דקות, עד להזהבה יפה.",
                 "הפעל טיימר (15 דק’)",
                 "תוספות מומלצות: מומלץ להוסיף לאורז בצל בינוני מטוגן (אם אתם מטגנים בצל אז תטגנו קצת גם את הגזר המגורד). אפשר להוסיף גם צימוקים, צנוברים, אפונה משקית קפואה.",
                },
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2018/02/%D7%A2%D7%95%D7%A3-%D7%95%D7%90%D7%95%D7%A8%D7%96-%D7%91%D7%AA%D7%A0%D7%95%D7%A8.jpg"
            },

             new Resipe()
            {
                idResipe = 9,
                nameResipe = "חזה עוף עם תפוח אדמה",
                idKategory = 2,
                preparationTime = 15,
                DifficultyLevel = 3,
                dateAdd = new DateTime(),
                components = new List<string>() {
                "1 בצל בינוני-גדול קצוץ",
                 "800 גרם חזה עוף חתוך לקוביות קטנות (בגודל כס”מ וחצי)",
                 "3 תפוחי אדמה בינוניים קלופים חתוכים לקוביות קטנות (בגודל כס”מ וחצי)",
                 "חצי כוס מים",
                 "תיבול: חצי כפית כורכום, כפית גדושה פפריקה מתוקה, כפית וחצי מלח, קמצוץ פלפל שחור",
                },
                preparation = new List<string>() {
                 "                מחממים סיר גדול (אש בינונית) עם 2-3 כפות שמן ומטגנים את הבצל כדקה (אין צורך להמתין שיזהיב).",
                 "מוסיפים את קוביות העוף ומבשלים תוך כדי ערבוב כדקה נוספת. מוסיפים את קוביות תפוחי האדמה ומתבלים בכורכום, פפריקה, מלח ופלפל שחור. מוזגים חצי כוס מים, מערבבים ומכסים את הסיר. מבשלים על אש בינונית-נמוכה במשך 30-40 דקות, עד שתפוחי האדמה נעשים רכים. יש לערבב את התבשיל כל 10 דקות ולוודא שהוא אינו מתייבש. במידה וכן – יש להוסיף מים לפי הצורך.",
                 "הפעל טיימר (30 דק’)",
                 "מומלץ להשתמש בסיר עם ציפוי שאינו נדבק.",
                },
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2017/01/%E2%80%8F%E2%80%8FDSC_0057-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
            },

                new Resipe()
            {
                idResipe =10,
                nameResipe = "עוף בחרדל ודבש בתנור",
                idKategory = 2,
                preparationTime = 20,
                DifficultyLevel =1,
                dateAdd = new DateTime(),
                components = new List<string>() {
                 "1 קילו חתיכות עוף ( 6-8 ירכיים, שוקיים, כנפיים וכו’)",
                 "2 תפוחי אדמה בינוניים קלופים חתוכים",
                 "2 בטטות בינוניות קלופות חתוכות",
                 "2 גזרים בינוניים קלופים חתוכים",
                 "מרינדה לעוף: 4 כפות שמן, 2 כפות דבש, כפית גדושה חרדל דיז’ון, 2 שיני שום כתושות, כפית פפריקה מתוקה, חצי כפית מלח, קמצוץ פלפל שחור",
                },
                preparation = new List<string>() {
                "מערבבים את כל חומרי המרינדה בקערית ומתבלים את חלקי העוף והירקות.",
                 "מניחים על תבנית גדולה ומכניסים לתנור בחום 180 מעלות במשך שעה וחצי.",
                 "הפעל טיימר (90 דק’)",
                },
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2016/12/%E2%80%8F%E2%80%8FDSC_0032-%D7%A2%D7%95%D7%AA%D7%A7.jpg"
            },
                 new Resipe()
            {
                idResipe = 11,
                nameResipe = "עוגה במילוי טחינה ואגוזים",
                idKategory = 3,
                preparationTime = 30,
                DifficultyLevel = 1,
                dateAdd = new DateTime(),
                components = new List<string>() { "  2 ביצים",
                 "שליש כוס (66 ג’) סוכר",
                 "שליש כוס (80 מ”ל) שמן",
                 "חצי כפית תמצית וניל",
                 "חצי כוס (120 מ”ל) מיץ תפוזים",
                 "כוס קמח תופח (140 ג’) *אפשר לערבב כוס קמח רגיל עם כפית אבקת אפיה",
                 "רבע כפית שטוחה אבקת סודה לשתיה",
                   "למילוי:",
                 "2 כפות טחינה גולמית + כף מלאה דבש או מייפל (לערבב יחד בקערית)",
                 "2 כפות גדושות אגוזי מלך טחונים",
                  },
                preparation = new List<string>() {    " מחממים תנור מראש ל-180 מעלות ומשמנים תבנית אינגליש קייק.",
                 "מערבבים בקערית 2 כפות טחינה גולמית עם כף מלאה דבש/מייפל ומניחים בצד.",
                 "מערבבים בקערה (בעזרת מטרפה ידנית או מיקסר) את הביצים עם הסוכר. מוסיפים שמן, תמצית וניל ומיץ ומערבבים. מוסיפים קמח תופח ואבקת סודה לשתיה ומערבבים קלות עד לאיחוד חומרים.",
                 "טחינה והדבש ומפזרים אגוזים טחונים. יוצקים מעל את יתר הבלילה (הבלילה לא אמורה לכסות את כל המילוי) ומערבבים קלות עם סכין (כמו שמערבבים עוגת שיש).",
                 "מכניסים לתנור החם ואופים במשך כ-30 דקות, עד שקיסם יוצא יבש.", },
                idMistamesh = 1,
                imgSrc = "https://www.10dakot.co.il/wp-content/uploads/2020/07/%E2%80%8F%E2%80%8FDSC_0014-%D7%A2%D7%95%D7%AA%D7%A7-1-800x532.jpg"
            },


            //לא למחוק!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! זה בשביל שיוכלו לשים עוד מתכון בקלות
            //ליצור העתק מפה ולשם להכני את הנתונים
            // new Resipe()
            //{
            //    idResipe = 0,
            //    nameResipe = "null",
            //    idKategory = 0,
            //    preparationTime = 0,
            //    levelOfDifficalty = 0,
            //    dateAdd = new DateTime(),
            //    components = new List<string>() { "string[]=[]" },
            //    preparation = new List<string>() { "string[]=[]" },
            //    idMistamesh = 0,
            //    imgSrc = "null"
            //},


                //"0",
                // " 1",
                // "3",
                // "4",
                // "5",
                // "6",
                // "7",
                //   "8",
                // " 9",
                // "10",
                // "11",
                // "12",
                // "13",
                // "14",
            

        };
    }
}















